docs/posts/2011-11-30-using-keynote-in-class.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 17, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Using Keynote in Class</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Using Keynote in Class</h1>
<p class="subtitle" role="doc-subtitle">Nov 30, 2011</p>
</header><p>
I have been using Keynote for iOS for lecture presentations in classes this semester. The process has been so easy, that this is the first semester that I have consistently used slide presentations during lectures. Most of my presentations were initially prepared on the Mac, then imported into Keynote for iOS on the iPad. Keynote for iOS seems to be fairly adept at importing transitions and effects. My only complaint is that the default font used in my preferred theme is different in the iOS version than in the desktop version of Keynote. 
</p>

<p>
I use the Remote app on the iPhone as a presentation controller. I was a bit apprehensive at first. I have a Bluetooth presentation controller that I preferred to use in the past. I like having the hardware buttons for moving through the slides. That way, I could simply feel the button, change the slide, and never have to look at the controller. I find that I can do the same thing with the Remote app, however. Slide changes occur when the presenter swipes a finger across the screen, exactly like navigating through screens on an iOS device. I found that it is very natural to hold the phone in one hand, and swipe the screen with the index finger of that same hand to change the slide. A swipe in the other direction moves to the previous slide. There is no need to look at the phone to change slides. It is easy, natural, and I have yet to drop the phone after a semester&rsquo;s worth of lectures. I can glance at the phone to see the next slide in the queue, a handy feature that my usual remote lacks.
</p>

<p>
When I first started using the Remote app with Keynote for iOS, the two worked seamlessly. Both the iPad and iPhone were on the same wi-fi network, so the iPhone immediately saw the presentation that was running on the iPad. At some point, though, the two stopped connecting to each other. This began at the same time that I updated devices to iOS. Unfortunately, I don&rsquo;t know if it is related to iOS or if it is a result of changes in the University&rsquo;s network. I have found that connecting the iPad to the iPhone using the personal hotspot works flawlessly. That does require a few extra steps before the presentation can begin.
</p>

<p>
Even so, I am extremely pleased with Keynote for iOS and the companion Remote app. I simply carry in the iPad and the adapter cable, plug it in to the projector cable, and begin the presentation. No boot-up time and not heavy laptop. It&rsquo;s quick, easy, and it just works, assuming you pay AT&amp;amp;T for the privilege of using your phone as a personal hotspot.
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 17, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
